# 스트레스 원인에 대한 아이콘 dictionary 업데이트
stressor_icons = {
    "치열한 경쟁" : "🔥",
    "과제 부담" : "📑",
    "교수님과의 관계" : "👨‍🏫",
    "평가" : "💯",
    "학업 부담" : "😣",
    "수업 난이도" : "😵",
    "수업 참여 부담" : "🙋‍♀️",
    "제한된 시간" : "⏰",
}

# 학업 스트레스 증상에 대한 아이콘 dictionary 업데이트
symptoms_icons = {
    "수면 장애" : "🛌",
    "만성 피로" : "🥱",
    "두통" : "🤕",
    "복부 통증 등의 소화 문제" : "💩",
    "손톱 물기" : "💅",
    "졸음" : "💤",
    "불안감" : "👀",
    "우울감" : "😢",
    "절망감" : "🧎",
    "집중 저하" : "🤪",
    "공격성 증가" : "😈",
    "논쟁 경향" : "🗯️",
    "사람들로부터의 고립" : "🏝️",
    "학업에 대한 무관심" : "🎮",
    "음식 섭취 증가 또는 감소" : "🍕",
}

# 학업 스트레스 대처 전략에 대한 아이콘 dictionary 업데이트
coping_icons = {
    "능동적 대응" : "😎",
    "계획 수립 및 수행" : "✍️",
    "자신에 대한 칭찬" : "👍",
    "종교적 신념" : "🙏",
    "상황에 대한 정보 수집" : "📋",
    "감정 표출 및 비밀 공유" : "📩",
}